Revit 2027 API
IFCUserDefinedPropertyType Enumeration
 An enumerated type listing user-defined property types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCUserDefinedPropertyType
Public Enumeration IFCUserDefinedPropertyType
public enum class IFCUserDefinedPropertyType
type IFCUserDefinedPropertyType
Members
Member name | Value | Description
Bounded | 1 |  The property is a bounded value property.
List | 2 |  The property is a list value property.
Single | 0 |  The property is a single value property.
Table | 3 |  The property is a table value property.
See Also
Reference
Autodesk.Revit.DB Namespace